# created by danger_of_telegram

import asyncio
import random

from userbot.utils import admin_cmd


@bot.on(admin_cmd(pattern=r"joint", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    await event.edit("നിന്റെ തന്തഞാനാടാ ....")
    await asyncio.sleep(2)
    x = random.randrange(1, 24)
    if x == 1:
        await event.edit("നീയൊക്കെ ഏത് പൂറിലെ രോമം തിന്ന് ഉണ്ടായ പുലയാടി മോനാണ്")
    if x == 2:
        await event.edit(
            "അതന്നെ പൂറി മോനെ പറഞ്ഞേനിന്റെയൊക്കെ വീട്ടിലെ ആളുകളുടെ അവസ്‌ഥപോയി ചത്തുടെ മൈരേ"
        )
    if x == 3:
        await event.edit(
            "നിന്റെ തീട്ട കൂതി തുറന്നു വെക്കോ പന്നി പടക്കം വെച്ചു നിന്റെ തന്ത ടെ ഉണങ്ങിയ കുണ്ണ അതിൽ കേറ്റി വെച്ചു സിമന്റു വെച്ചു അടച്ചും പന്നി പടക്കത്തിന്റെ തിരി പുറത്തേക്കു നീട്ടി തീ കൊളുത്തി തീട്ട് കൂതി പൊട്ടിത്തെറി നിന്റെ തള്ള വന്നു നക്കി നിന്റെ തീട്ട കൂതിയും അപ്പന്റെ അണ്ടിയും😆😆😆"
        )
    if x == 4:
        await event.edit(
            "നിന്റെ തള്ള ഏതാടാ പൂറി അവളെ ഞങ്ങൾ ബലാത്സംഗം ചെയ്തപ്പോൾ പോലും അവൾ ഇങ്ങനെ ഒന്നും പറഞ്ഞിട്ടില്ലല്ലോ... നീ അവൾക്ക് ഉണ്ടായതന്നെ ആണോ"
        )
    if x == 5:
        await event.edit("നിയേതാ മൈരേ എനിക്കിട്ട് ഉണ്ടാക്കാൻ പൂറി മോനെ")
    if x == 6:
        await event.edit("വല്ല പട്ടിയുടെ കൂതിയില് വിരലിട്ടു നക്കി വാ കൂത്തിച്ചി")
    if x == 7:
        await event.edit(
            "നിനക്ക് ഇല്ലാത്ത നിന്റെ അപ്പനോട് പോയി ചോയിനിന്റെ അപ്പനെ ഒരു കുണ്ടൻ വിറ്റത് ഞാനട"
        )
    if x == 8:
        await event.edit(
            "നിന്റെ അമ്മേടെ കൂതി തുറന്ന് നോക്കിയിട്ട് വാ അതിൽ മൈരു ഉണ്ടേൽ അത് വടിച്ചു കൊടു അറവാണി പൂണ്ട"
        )
    if x == 9:
        await event.edit(
            "നിനക്കു തന്ത ഇല്ലാത്തത് എന്റെ തെറ്റല്ല പട്ടി പൂറി മോൻ ഉണ്ടായ ശികണ്ടി പൂറി Inbox വന്ന് കോണക്കാൻ പടി അല്ലാതെ block ചെയ്ത് പോവാൻ അല്ല നിനക്കുള്ള വടയും ചായയും ഞ ഇന്ന് തരും"
        )
    if x == 10:
        await event.edit(
            "നിന്റെ അമ്മേടെ സമയം തെറ്റിയുള്ള പ്രസവത്തിൽ ഉണ്ടായത് അല്ലെ അപ്പൊ നിനക്കു അതൊക്കെ തോന്നും"
        )
    if x == 11:
        await event.edit(
            "നിന്നെ പോലെ ഗ്രൂപ്പിൽ കൊരച്ചു എനിക് ഉണ്ടാക്കാൻ വന്നവൻ ഞ അണ്ണാക്കിൽ കൊടുത്തു വിട്ടിട്ടുണ്ട്ഇനി നിയല്ലേഅതും ഞ തരാ"
        )
    if x == 12:
        await event.edit(
            "നിന്റെ തള്ള ക്ക് നി ഉണ്ടായത് ന്നെ കക്കൂസിലെ തീറ്റത്തിലെ കടുക് മണി മുളച്ചു ഉണ്ടായത് അല്ലെ അപ്പൊ ഇങ്ങനെ സംഭവിക്കും"
        )
    if x == 13:
        await event.edit(
            "നിന്റെ അമ്മേനെ കൂട്ടമായി പണ്ണാൻ കൊണ്ട് പോയപ്പോ നിന്റെ അനിയതിയെയും വിറ്റ്😂😂"
        )
    if x == 14:
        await event.edit(
            "അസ്റാർഡാമിൽ വെച്ചു നിന്നെ കൂട്ടമായി പണ്ണുമ്പോഴും അവിടെ വെച്ചു നിന്റെ അപ്പന്റെ അണ്ടി ഊമ്പുകയും നിന്റെ ഓർഗസ സമയത്തു നിന്റെ പൂറിലെ കന്ത് പറിച്ചെടുകകയും ചെയ്യുംഎന്ത് മനോഹരമായ കളിക്കരിയാണ് നി..🥳🥳"
        )
    if x == 15:
        await event.edit("ഇവൻ ആരുടെ അണ്ടിയ ഇപ്പൊ ഊമ്പുന്നെ🙄🙄")
    if x == 16:
        await event.edit(
            "കള്ള അവരാതി ക്ക് ഉണ്ടായ പന്ന പൂറി മോനെനി ഏത് ഊമ്പി തെറി പറഞ്ഞാലും തീട്ടം ഉള്ള നിന്റെ കുണ്ട നിന്റർ തള്ള മത്തിഇനി വീട്ടിൽ പെങ്ങൾ പൂറി ഉണ്ടേൽ അവൾക്കും ഇത് അയക്കോ മൈരേ നിപരവെടി തള്ള ക്ക് ഉണ്ടായ അറവാണിച്ചു എംപൂറി മോനെ.തന്ത കുണ്ടൻ പണി എടുത്തു നിന്നെ ഉണ്ടാക്കിഅത്ര കാഴ്‌പ്പ് ആണ് നിന്റെ തളളക്ക്.ഇന്നലെ തള്ളയും പെങ്ങളും കവച്ചു കിടകയിരുന്നു4 ചാവലി പട്ടിയുടെ കുണ്ണ ക്ക് വെണ്ടി അത് 2 കൂടി ചപ്പി പട്ടിയുടെ തീട്ടം മുഴുവൻ തിന്ന് ആണ് പോയത്തന്ത മാറി കുണ്ടൻ അടിക്കുന്ന നിന്റർ ഓട്ടയിൽമൈര് പൂറി മോനെഎവിടാ പട്ടി ക്ക് ഉണ്ടായ കുണ്ട നി ഊംബി പോയോ തനത് ടെ കുണ്ണ"
        )
